In [3]:
import pandas as pd
x=[3,4,5,6,7,8]
var=pd.Series(x)
print(var)

0    3
1    4
2    5
3    6
4    7
5    8
dtype: int64

In [4]:
import pandas as pd
x=[3,4,5,6]
var=pd.Series(x, index=['a','b','c','d'], dtype="float", name="python")
print(var)

a    3.0
b    4.0
c    5.0
d    6.0
Name: python, dtype: float64

In [6]:
dic={"Name" :["atharv","ram", "jaya"], "rank": [1,2,3,4,5,6,7], "marks" : [12,43,56]}
var=pd.Series(dic)
print(var)

Name       [atharv, ram, jaya]
rank     [1, 2, 3, 4, 5, 6, 7]
marks             [12, 43, 56]
dtype: object

In [7]:
s=pd.Series(12,index=[1,2,3,4,5])
print(s)

1    12
2    12
3    12
4    12
5    12
dtype: int64

In [8]:
s1=pd.Series(12,index=[1,2,3,4,5])
s2=pd.Series(12,index=[1,2,3])
print(s1+s2)

1    24.0
2    24.0
3    24.0
4     NaN
5     NaN
dtype: float64

In [9]:
x=[3,4,5,6,7,8]
var=pd.DataFrame(x)
print(var)

   0
0  3
1  4
2  5
3  6
4  7
5  8

In [11]:
dic={"Name" :["atharv","ram", "jaya"], "rank": [1,2,3,4,5,6,7], "marks" : [12,43,56]}
var=pd.DataFrame(dic) #nhi chalega coz sabki length same nahi hai
print(var)

ValueError: All arrays must be of the same length

In [14]:
dic={"Name" :["atharv","ram", "jaya"], "rank": [1,2,3], "marks" : [12,43,56]}
var=pd.DataFrame(dic, columns=["Name", "marks"], index=["ek", "don", "tin"]) 
print(var)
print(var["Name"][2])

       Name  marks
ek   atharv     12
don     ram     43
tin    jaya     56
jaya

In [15]:
l=[[1,2,3],[4,5,6]]
var=pd.DataFrame(l)
print(var)

   0  1  2
0  1  2  3
1  4  5  6

In [16]:
x={"s":pd.Series(12,index=[1,2,3]), "r": pd.Series(24,index=[1,2,3])}
var=pd.DataFrame(x)
print(var)

    s   r
1  12  24
2  12  24
3  12  24

In [17]:
x={"s":pd.Series(12,index=[1,2,3]), "r": pd.Series(24,index=[1,2,3])}
var=pd.DataFrame(x)
var["c"]=var["s"]+var["r"]
print(var)

    s   r   c
1  12  24  36
2  12  24  36
3  12  24  36

In [19]:
x={"s":pd.Series(12,index=[1,2,3]), "r": pd.Series(24,index=[1,2,3])}
var=pd.DataFrame(x)
var["c"]=var["s"]+var["r"]
var["bool"] = var["s"]>20
print(var)

    s   r   c   bool
1  12  24  36  False
2  12  24  36  False
3  12  24  36  False

In [20]:
x={"s":pd.Series(12,index=[1,2,3]), "r": pd.Series(24,index=[1,2,3])}
var=pd.DataFrame(x)
var.insert(1, "somenum", [12,25,75])
print(var)

    s  somenum   r
1  12       12  24
2  12       25  24
3  12       75  24

In [21]:
x={"s":pd.Series(12,index=[1,2,3]), "r": pd.Series(24,index=[1,2,3])}
var=pd.DataFrame(x)
var.insert(1, "somenum", var["s"]+5)
print(var)

    s  somenum   r
1  12       17  24
2  12       17  24
3  12       17  24

In [24]:
x={"s":pd.Series(12,index=[1,2,3]), "r": pd.Series(24,index=[1,2,3])}
var=pd.DataFrame(x)
var["kahitari"]=var["s"][:3]
print(var)

    s   r  kahitari
1  12  24        12
2  12  24        12
3  12  24        12

In [25]:
x={"s":pd.Series(12,index=[1,2,3]), "r": pd.Series(24,index=[1,2,3])}
var=pd.DataFrame(x)
var.insert(1, "somenum", [12,25,75])
var.pop("s")
del var["r"]
print(var)

   somenum
1       12
2       25
3       75

In [26]:
x={"s":pd.Series(12,index=[1,2,3]), "r": pd.Series(24,index=[1,2,3])}
var=pd.DataFrame(x)
var.insert(1, "somenum", var["s"]+5)
print(var)
var.to_csv("jadu.csv")

    s  somenum   r
1  12       17  24
2  12       17  24
3  12       17  24

In [27]:
x={"s":pd.Series(12,index=[1,2,3]), "r": pd.Series(24,index=[1,2,3])}
var=pd.DataFrame(x)
var.insert(1, "somenum", var["s"]+5)
print(var)
var.to_csv("jadu2.csv", index=False, header=[1,2,3])

    s  somenum   r
1  12       17  24
2  12       17  24
3  12       17  24

In [4]:
import pandas as pd
csv1 =pd.read_csv("C:\\Users\\athar\\Downloads\\file-coderstool.csv")
print(csv1)

                  ID        DATE                                 EMAIL
0   324VLEQM7YZG84I2  02-10-2016  idell-silas80@sierra.urbinopesaro.it
1   0JHE9GDRD0F7BYKE  02-10-2013                       tova344@wav.com
2   74ATR8MFYFVAMQEN  10-09-1971       laquita_irizarry505@hotmail.com
3   X5QR56LOM3874JHB  05-11-1996           lauriykmlanconn@teenage.com
4   L6QILJX4PLV5TLJ6  29-06-2022                 ward68@dead.health.nz
5   VLPVS8NY9KO8UUOQ  02-11-2016               imelda86549@hotmail.com
6   UAA8Y8R8UX6H8PLT  04-01-1979           gussielogan5483@loading.com
7   CE4QP5TJAZCRDSVN  04-04-2000             toya475@strengthening.com
8   2SBLHRQBAIA5R5EU  29-10-2000                    elnora216@wise.com
9   4HVOAR7R3240U79O  05-01-1995        brittani58730@subsidiaries.com
10  5DBBE9DKAYZ42ZYG  20-01-2001             xenia.farrington@hair.com
11  RFTBYJ0B8NHJLFUI  07-03-2023             cuc-ontiveros@hotmail.com
12  VBJLEG3K1JI1OGH8  09-01-2015                        denyse4@cz.com
13  41C1INQTA7C9ONGE  02-09-2016               hector.thorp@monroe.com
14  ICQ6T24681L8E4RZ  06-11-2005            arnoldostephen@belarus.com
15  PPJBJDHYIYCU3Y09  11-10-1972             michel_somers42@yahoo.com
16  JLQCQ0SV00HT9RIG  28-12-1992          jarred-lawhorn401@answer.com
17  YGT2FQQK60MTTDAU  16-09-1987           esperanza.deloach3@miss.com
18  A8MJF5BSZQ4ZJQMN  24-11-1999              suzanbottoms@sublime.com
19  JL78CFEJACI7286D  29-04-1996           joycelyn.chisolm0@yahoo.com
20  OUV7IQJIHHRFR7CH  26-01-1984             florentina91698@yahoo.com
21  XQMVIYXJC2MFZ06Q  23-12-2012           jule_hammond5556@hammer.com
22  IV8EOL5B7V800ZBB  23-11-2022                     ok081@linking.com
23  QFSS8VHI5FKU34CY  02-11-1996                   lucius063@gmail.com
24  PX9BUSXEOM8XLL28  09-06-2012       riley_whitten6616@financing.com
25  RTQ4PKUKXQP9STET  23-09-2007          miss-arcf.yamamoto.miyagi.jp
26  9B1KDFKMZFLL39TZ  07-09-1982             luann-limon@yesterday.com
27  U76F4RD9NMQY7MC1  15-03-1981                moshe3360@ministry.com
28  IHRBGSKQO2F6KDXC  23-01-2017            starr.headley706@yahoo.com

In [5]:
import pandas as pd
csv1 =pd.read_csv("C:\\Users\\athar\\Downloads\\file-coderstool.csv", nrows=2)
print(csv1)

                 ID        DATE                                 EMAIL
0  324VLEQM7YZG84I2  02-10-2016  idell-silas80@sierra.urbinopesaro.it
1  0JHE9GDRD0F7BYKE  02-10-2013                       tova344@wav.com

In [6]:
import pandas as pd
csv1 =pd.read_csv("C:\\Users\\athar\\Downloads\\file-coderstool.csv", usecols=["ID", "EMAIL"])
print(csv1)

                  ID                                 EMAIL
0   324VLEQM7YZG84I2  idell-silas80@sierra.urbinopesaro.it
1   0JHE9GDRD0F7BYKE                       tova344@wav.com
2   74ATR8MFYFVAMQEN       laquita_irizarry505@hotmail.com
3   X5QR56LOM3874JHB           lauriykmlanconn@teenage.com
4   L6QILJX4PLV5TLJ6                 ward68@dead.health.nz
5   VLPVS8NY9KO8UUOQ               imelda86549@hotmail.com
6   UAA8Y8R8UX6H8PLT           gussielogan5483@loading.com
7   CE4QP5TJAZCRDSVN             toya475@strengthening.com
8   2SBLHRQBAIA5R5EU                    elnora216@wise.com
9   4HVOAR7R3240U79O        brittani58730@subsidiaries.com
10  5DBBE9DKAYZ42ZYG             xenia.farrington@hair.com
11  RFTBYJ0B8NHJLFUI             cuc-ontiveros@hotmail.com
12  VBJLEG3K1JI1OGH8                        denyse4@cz.com
13  41C1INQTA7C9ONGE               hector.thorp@monroe.com
14  ICQ6T24681L8E4RZ            arnoldostephen@belarus.com
15  PPJBJDHYIYCU3Y09             michel_somers42@yahoo.com
16  JLQCQ0SV00HT9RIG          jarred-lawhorn401@answer.com
17  YGT2FQQK60MTTDAU           esperanza.deloach3@miss.com
18  A8MJF5BSZQ4ZJQMN              suzanbottoms@sublime.com
19  JL78CFEJACI7286D           joycelyn.chisolm0@yahoo.com
20  OUV7IQJIHHRFR7CH             florentina91698@yahoo.com
21  XQMVIYXJC2MFZ06Q           jule_hammond5556@hammer.com
22  IV8EOL5B7V800ZBB                     ok081@linking.com
23  QFSS8VHI5FKU34CY                   lucius063@gmail.com
24  PX9BUSXEOM8XLL28       riley_whitten6616@financing.com
25  RTQ4PKUKXQP9STET          miss-arcf.yamamoto.miyagi.jp
26  9B1KDFKMZFLL39TZ             luann-limon@yesterday.com
27  U76F4RD9NMQY7MC1                moshe3360@ministry.com
28  IHRBGSKQO2F6KDXC            starr.headley706@yahoo.com

In [7]:
import pandas as pd
csv1 =pd.read_csv("C:\\Users\\athar\\Downloads\\file-coderstool.csv", skiprows=[1,2,3])
print(csv1)

                  ID        DATE                            EMAIL
0   X5QR56LOM3874JHB  05-11-1996      lauriykmlanconn@teenage.com
1   L6QILJX4PLV5TLJ6  29-06-2022            ward68@dead.health.nz
2   VLPVS8NY9KO8UUOQ  02-11-2016          imelda86549@hotmail.com
3   UAA8Y8R8UX6H8PLT  04-01-1979      gussielogan5483@loading.com
4   CE4QP5TJAZCRDSVN  04-04-2000        toya475@strengthening.com
5   2SBLHRQBAIA5R5EU  29-10-2000               elnora216@wise.com
6   4HVOAR7R3240U79O  05-01-1995   brittani58730@subsidiaries.com
7   5DBBE9DKAYZ42ZYG  20-01-2001        xenia.farrington@hair.com
8   RFTBYJ0B8NHJLFUI  07-03-2023        cuc-ontiveros@hotmail.com
9   VBJLEG3K1JI1OGH8  09-01-2015                   denyse4@cz.com
10  41C1INQTA7C9ONGE  02-09-2016          hector.thorp@monroe.com
11  ICQ6T24681L8E4RZ  06-11-2005       arnoldostephen@belarus.com
12  PPJBJDHYIYCU3Y09  11-10-1972        michel_somers42@yahoo.com
13  JLQCQ0SV00HT9RIG  28-12-1992     jarred-lawhorn401@answer.com
14  YGT2FQQK60MTTDAU  16-09-1987      esperanza.deloach3@miss.com
15  A8MJF5BSZQ4ZJQMN  24-11-1999         suzanbottoms@sublime.com
16  JL78CFEJACI7286D  29-04-1996      joycelyn.chisolm0@yahoo.com
17  OUV7IQJIHHRFR7CH  26-01-1984        florentina91698@yahoo.com
18  XQMVIYXJC2MFZ06Q  23-12-2012      jule_hammond5556@hammer.com
19  IV8EOL5B7V800ZBB  23-11-2022                ok081@linking.com
20  QFSS8VHI5FKU34CY  02-11-1996              lucius063@gmail.com
21  PX9BUSXEOM8XLL28  09-06-2012  riley_whitten6616@financing.com
22  RTQ4PKUKXQP9STET  23-09-2007     miss-arcf.yamamoto.miyagi.jp
23  9B1KDFKMZFLL39TZ  07-09-1982        luann-limon@yesterday.com
24  U76F4RD9NMQY7MC1  15-03-1981           moshe3360@ministry.com
25  IHRBGSKQO2F6KDXC  23-01-2017       starr.headley706@yahoo.com

In [8]:
import pandas as pd
csv1 =pd.read_csv("C:\\Users\\athar\\Downloads\\file-coderstool.csv", index_col="DATE")
print(csv1)

                          ID                                 EMAIL
DATE
02-10-2016  324VLEQM7YZG84I2  idell-silas80@sierra.urbinopesaro.it
02-10-2013  0JHE9GDRD0F7BYKE                       tova344@wav.com
10-09-1971  74ATR8MFYFVAMQEN       laquita_irizarry505@hotmail.com
05-11-1996  X5QR56LOM3874JHB           lauriykmlanconn@teenage.com
29-06-2022  L6QILJX4PLV5TLJ6                 ward68@dead.health.nz
02-11-2016  VLPVS8NY9KO8UUOQ               imelda86549@hotmail.com
04-01-1979  UAA8Y8R8UX6H8PLT           gussielogan5483@loading.com
04-04-2000  CE4QP5TJAZCRDSVN             toya475@strengthening.com
29-10-2000  2SBLHRQBAIA5R5EU                    elnora216@wise.com
05-01-1995  4HVOAR7R3240U79O        brittani58730@subsidiaries.com
20-01-2001  5DBBE9DKAYZ42ZYG             xenia.farrington@hair.com
07-03-2023  RFTBYJ0B8NHJLFUI             cuc-ontiveros@hotmail.com
09-01-2015  VBJLEG3K1JI1OGH8                        denyse4@cz.com
02-09-2016  41C1INQTA7C9ONGE               hector.thorp@monroe.com
06-11-2005  ICQ6T24681L8E4RZ            arnoldostephen@belarus.com
11-10-1972  PPJBJDHYIYCU3Y09             michel_somers42@yahoo.com
28-12-1992  JLQCQ0SV00HT9RIG          jarred-lawhorn401@answer.com
16-09-1987  YGT2FQQK60MTTDAU           esperanza.deloach3@miss.com
24-11-1999  A8MJF5BSZQ4ZJQMN              suzanbottoms@sublime.com
29-04-1996  JL78CFEJACI7286D           joycelyn.chisolm0@yahoo.com
26-01-1984  OUV7IQJIHHRFR7CH             florentina91698@yahoo.com
23-12-2012  XQMVIYXJC2MFZ06Q           jule_hammond5556@hammer.com
23-11-2022  IV8EOL5B7V800ZBB                     ok081@linking.com
02-11-1996  QFSS8VHI5FKU34CY                   lucius063@gmail.com
09-06-2012  PX9BUSXEOM8XLL28       riley_whitten6616@financing.com
23-09-2007  RTQ4PKUKXQP9STET          miss-arcf.yamamoto.miyagi.jp
07-09-1982  9B1KDFKMZFLL39TZ             luann-limon@yesterday.com
15-03-1981  U76F4RD9NMQY7MC1                moshe3360@ministry.com
23-01-2017  IHRBGSKQO2F6KDXC            starr.headley706@yahoo.com

In [9]:
import pandas as pd
csv1 =pd.read_csv("C:\\Users\\athar\\Downloads\\file-coderstool.csv", header=2)
print(csv1)

    0JHE9GDRD0F7BYKE  02-10-2013                  tova344@wav.com
0   74ATR8MFYFVAMQEN  10-09-1971  laquita_irizarry505@hotmail.com
1   X5QR56LOM3874JHB  05-11-1996      lauriykmlanconn@teenage.com
2   L6QILJX4PLV5TLJ6  29-06-2022            ward68@dead.health.nz
3   VLPVS8NY9KO8UUOQ  02-11-2016          imelda86549@hotmail.com
4   UAA8Y8R8UX6H8PLT  04-01-1979      gussielogan5483@loading.com
5   CE4QP5TJAZCRDSVN  04-04-2000        toya475@strengthening.com
6   2SBLHRQBAIA5R5EU  29-10-2000               elnora216@wise.com
7   4HVOAR7R3240U79O  05-01-1995   brittani58730@subsidiaries.com
8   5DBBE9DKAYZ42ZYG  20-01-2001        xenia.farrington@hair.com
9   RFTBYJ0B8NHJLFUI  07-03-2023        cuc-ontiveros@hotmail.com
10  VBJLEG3K1JI1OGH8  09-01-2015                   denyse4@cz.com
11  41C1INQTA7C9ONGE  02-09-2016          hector.thorp@monroe.com
12  ICQ6T24681L8E4RZ  06-11-2005       arnoldostephen@belarus.com
13  PPJBJDHYIYCU3Y09  11-10-1972        michel_somers42@yahoo.com
14  JLQCQ0SV00HT9RIG  28-12-1992     jarred-lawhorn401@answer.com
15  YGT2FQQK60MTTDAU  16-09-1987      esperanza.deloach3@miss.com
16  A8MJF5BSZQ4ZJQMN  24-11-1999         suzanbottoms@sublime.com
17  JL78CFEJACI7286D  29-04-1996      joycelyn.chisolm0@yahoo.com
18  OUV7IQJIHHRFR7CH  26-01-1984        florentina91698@yahoo.com
19  XQMVIYXJC2MFZ06Q  23-12-2012      jule_hammond5556@hammer.com
20  IV8EOL5B7V800ZBB  23-11-2022                ok081@linking.com
21  QFSS8VHI5FKU34CY  02-11-1996              lucius063@gmail.com
22  PX9BUSXEOM8XLL28  09-06-2012  riley_whitten6616@financing.com
23  RTQ4PKUKXQP9STET  23-09-2007     miss-arcf.yamamoto.miyagi.jp
24  9B1KDFKMZFLL39TZ  07-09-1982        luann-limon@yesterday.com
25  U76F4RD9NMQY7MC1  15-03-1981           moshe3360@ministry.com
26  IHRBGSKQO2F6KDXC  23-01-2017       starr.headley706@yahoo.com

In [10]:
import pandas as pd
csv1 =pd.read_csv("C:\\Users\\athar\\Downloads\\file-coderstool.csv", names=["col1", "col2", "col3"])
print(csv1)

                col1        col2                                  col3
0                 ID        DATE                                 EMAIL
1   324VLEQM7YZG84I2  02-10-2016  idell-silas80@sierra.urbinopesaro.it
2   0JHE9GDRD0F7BYKE  02-10-2013                       tova344@wav.com
3   74ATR8MFYFVAMQEN  10-09-1971       laquita_irizarry505@hotmail.com
4   X5QR56LOM3874JHB  05-11-1996           lauriykmlanconn@teenage.com
5   L6QILJX4PLV5TLJ6  29-06-2022                 ward68@dead.health.nz
6   VLPVS8NY9KO8UUOQ  02-11-2016               imelda86549@hotmail.com
7   UAA8Y8R8UX6H8PLT  04-01-1979           gussielogan5483@loading.com
8   CE4QP5TJAZCRDSVN  04-04-2000             toya475@strengthening.com
9   2SBLHRQBAIA5R5EU  29-10-2000                    elnora216@wise.com
10  4HVOAR7R3240U79O  05-01-1995        brittani58730@subsidiaries.com
11  5DBBE9DKAYZ42ZYG  20-01-2001             xenia.farrington@hair.com
12  RFTBYJ0B8NHJLFUI  07-03-2023             cuc-ontiveros@hotmail.com
13  VBJLEG3K1JI1OGH8  09-01-2015                        denyse4@cz.com
14  41C1INQTA7C9ONGE  02-09-2016               hector.thorp@monroe.com
15  ICQ6T24681L8E4RZ  06-11-2005            arnoldostephen@belarus.com
16  PPJBJDHYIYCU3Y09  11-10-1972             michel_somers42@yahoo.com
17  JLQCQ0SV00HT9RIG  28-12-1992          jarred-lawhorn401@answer.com
18  YGT2FQQK60MTTDAU  16-09-1987           esperanza.deloach3@miss.com
19  A8MJF5BSZQ4ZJQMN  24-11-1999              suzanbottoms@sublime.com
20  JL78CFEJACI7286D  29-04-1996           joycelyn.chisolm0@yahoo.com
21  OUV7IQJIHHRFR7CH  26-01-1984             florentina91698@yahoo.com
22  XQMVIYXJC2MFZ06Q  23-12-2012           jule_hammond5556@hammer.com
23  IV8EOL5B7V800ZBB  23-11-2022                     ok081@linking.com
24  QFSS8VHI5FKU34CY  02-11-1996                   lucius063@gmail.com
25  PX9BUSXEOM8XLL28  09-06-2012       riley_whitten6616@financing.com
26  RTQ4PKUKXQP9STET  23-09-2007          miss-arcf.yamamoto.miyagi.jp
27  9B1KDFKMZFLL39TZ  07-09-1982             luann-limon@yesterday.com
28  U76F4RD9NMQY7MC1  15-03-1981                moshe3360@ministry.com
29  IHRBGSKQO2F6KDXC  23-01-2017            starr.headley706@yahoo.com

In [14]:
import pandas as pd
var1= pd.DataFrame({"a": [1,2,3,4], "b":[5,6,7,8]})
var2= pd.DataFrame({"a": [1,2,3,5], "c":[11,12,13,14]})
pd.merge(var1, var2, on="a")

   a  b   c
0  1  5  11
1  2  6  12
2  3  7  13

In [22]:
import pandas as pd
var1= pd.DataFrame({"a": [1,2,3,4], "b":[5,6,7,8]})
var2= pd.DataFrame({"a": [1,2,3,5], "c":[11,12,13,14]})
pd.merge(var1, var2, on="a", how="inner", indicator=True)

   a  b   c _merge
0  1  5  11   both
1  2  6  12   both
2  3  7  13   both

In [21]:
import pandas as pd
var1= pd.DataFrame({"a": [1,2,3,4], "b":[5,6,7,8]})
var2= pd.DataFrame({"a": [1,2,3,5], "c":[11,12,13,14]})
pd.merge(var1, var2, on="a", how="outer",indicator=True)

   a    b     c      _merge
0  1  5.0  11.0        both
1  2  6.0  12.0        both
2  3  7.0  13.0        both
3  4  8.0   NaN   left_only
4  5  NaN  14.0  right_only

In [20]:
import pandas as pd
var1= pd.DataFrame({"a": [1,2,3,4], "b":[5,6,7,8]})
var2= pd.DataFrame({"a": [1,2,3,5], "c":[11,12,13,14]})
pd.merge(var1, var2, on="a", how="left",indicator=True)

   a  b     c     _merge
0  1  5  11.0       both
1  2  6  12.0       both
2  3  7  13.0       both
3  4  8   NaN  left_only

In [19]:
import pandas as pd
var1= pd.DataFrame({"a": [1,2,3,4], "b":[5,6,7,8]})
var2= pd.DataFrame({"a": [1,2,3,5], "c":[11,12,13,14]})
pd.merge(var1, var2, on="a", how="right",indicator=True)

   a    b   c      _merge
0  1  5.0  11        both
1  2  6.0  12        both
2  3  7.0  13        both
3  5  NaN  14  right_only

In [25]:
import pandas as pd
var1= pd.DataFrame({"a": [1,2,3,4], "b":[5,6,7,8]})
var2= pd.DataFrame({"a": [1,2,3,5], "c":[11,12,13,14]})
pd.merge(var1, var2, left_index=True, right_index=True)

   a_x  b  a_y   c
0    1  5    1  11
1    2  6    2  12
2    3  7    3  13
3    4  8    5  14

In [26]:
import pandas as pd
var1= pd.DataFrame({"a": [1,2,3,4], "b":[5,6,7,8]})
var2= pd.DataFrame({"a": [1,2,3,5], "c":[11,12,13,14]})
pd.merge(var1, var2, left_index=True, right_index=True, suffixes=["name", "id"])

   aname  b  aid   c
0      1  5    1  11
1      2  6    2  12
2      3  7    3  13
3      4  8    5  14

In [28]:
sr1=pd.Series([1,2,3,4])
sr2=pd.Series([5,6,7,8])
pd.concat([sr1,sr2])

0    1
1    2
2    3
3    4
0    5
1    6
2    7
3    8
dtype: int64

In [29]:
var1= pd.DataFrame({"a": [1,2,3,4], "b":[5,6,7,8]})
var2= pd.DataFrame({"a": [1,2,3,5], "c":[11,12,13,14]})
pd.concat([var1,var2])

   a    b     c
0  1  5.0   NaN
1  2  6.0   NaN
2  3  7.0   NaN
3  4  8.0   NaN
0  1  NaN  11.0
1  2  NaN  12.0
2  3  NaN  13.0
3  5  NaN  14.0

In [30]:
var1= pd.DataFrame({"a": [1,2,3,4], "b":[5,6,7,8]})
var2= pd.DataFrame({"a": [1,2,3,5], "c":[11,12,13,14]})
pd.concat([var1,var2], axis=1)

   a  b  a   c
0  1  5  1  11
1  2  6  2  12
2  3  7  3  13
3  4  8  5  14

In [32]:
var1= pd.DataFrame({"a": [1,2,3,4], "b":[5,6,7,8]})
var2= pd.DataFrame({"a": [1,2], "c":[11,12]})
pd.concat([var1,var2], axis=1, join="inner")

   a  b  a   c
0  1  5  1  11
1  2  6  2  12

In [33]:
var1= pd.DataFrame({"a": [1,2,3,4], "b":[5,6,7,8]})
var2= pd.DataFrame({"a": [1,2], "c":[11,12]})
pd.concat([var1,var2], axis=1, join="outer")

   a  b    a     c
0  1  5  1.0  11.0
1  2  6  2.0  12.0
2  3  7  NaN   NaN
3  4  8  NaN   NaN

In [39]:
var= pd.DataFrame({"name":["a","c","b","c","a","c","b","c","a","b","a"],
                   "s1":[1,2,3,4,5,6,7,8,9,10,11],
                    "s2":[21,22,23,24,25,26,27,28,29,30,31]})
print(var)

   name  s1  s2
0     a   1  21
1     c   2  22
2     b   3  23
3     c   4  24
4     a   5  25
5     c   6  26
6     b   7  27
7     c   8  28
8     a   9  29
9     b  10  30
10    a  11  31

In [42]:
varnew=var.groupby("name")
for x, y in varnew:
    print(x)
    print(y)

a
   name  s1  s2
0     a   1  21
4     a   5  25
8     a   9  29
10    a  11  31
b
  name  s1  s2
2    b   3  23
6    b   7  27
9    b  10  30
c
  name  s1  s2
1    c   2  22
3    c   4  24
5    c   6  26
7    c   8  28

In [44]:
varnew.get_group("b")

  name  s1  s2
2    b   3  23
6    b   7  27
9    b  10  30

In [45]:
varnew.min()

      s1  s2
name
a      1  21
b      3  23
c      2  22

In [46]:
varnew.mean()

            s1         s2
name
a     6.500000  26.500000
b     6.666667  26.666667
c     5.000000  25.000000

In [47]:
li = list(varnew)#list mai convert ab kuch bhi kro iske sath
print(li)

[('a',    name  s1  s2
0     a   1  21
4     a   5  25
8     a   9  29
10    a  11  31), ('b',   name  s1  s2
2    b   3  23
6    b   7  27
9    b  10  30), ('c',   name  s1  s2
1    c   2  22
3    c   4  24
5    c   6  26
7    c   8  28)]